Перем КонтекстЯдра;
Перем Ожидаем;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	НаборТестов.НачатьГруппу("Тесты проверки паролей");
	НаборТестов.Добавить("ТестДолжен_ПроверитьВалидныйПароль", , "ФУНК_ПС_001. Позитивный тест. пароль сложный");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПростойПароль", , "ФУНК_ПС_002. Негативный тест. пароль слишком простой");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПарольБезСпецсимволов", , "ФУНК_ПС_003. Негативный тест. пароль без специальных символов");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПарольБезЗаглавныхБукв", , "ФУНК_ПС_004. Негативный тест. пароль без заглавных букв");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПарольСлишкомКороткий", , "ФУНК_ПС_005. Негативный тест. слишком короткий пароль");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПарольБезЦифр", , "ФУНК_ПС_006. Негативный тест. пароль без цифр");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПарольСодержащийТолькоСпецсимволы", , "ФУНК_ПС_007. Негативный тест. пароль, содержащий только спецсимволы");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПарольСПовторяющимисяСимволами", , "ФУНК_ПС_008. Негативный тест. пароль с повторяющимися символами");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПустойПароль", , "ФУНК_ПС_009. Негативный тест. пустой пароль");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьВалидныйПароль() Экспорт
	ПарольДляПроверки = "+y%f#8Gn&D_kWP"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоИстина();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПростойПароль() Экспорт
	ПарольДляПроверки = "12345"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарольБезСпецсимволов() Экспорт
	ПарольДляПроверки = "Password123"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарольБезЗаглавныхБукв() Экспорт
	ПарольДляПроверки = "password123!"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарольСлишкомКороткий() Экспорт
	ПарольДляПроверки = "P@1a"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарольБезЦифр() Экспорт
	ПарольДляПроверки = "Password!"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарольСодержащийТолькоСпецсимволы() Экспорт
	ПарольДляПроверки = "@#$%^&*"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарольСПовторяющимисяСимволами() Экспорт
	ПарольДляПроверки = "AAAAAA111!!!"; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПустойПароль() Экспорт
	ПарольДляПроверки = ""; 
	Результат = РаботаСоСправочникамиСервер.ПроверитьЧтоПарольСложный(ПарольДляПроверки);
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры
