
&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ОбменСФилиалами(); 
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ОбменСФилиалами() Экспорт 

	ВыборкаУзлов = ПланыОбмена.Доставка.Выбрать();

	Пока ВыборкаУзлов.Следующий() Цикл 

		// Произвести обмен данными со всеми узлами, кроме текущего (ЭтотУзел) 
		Если ВыборкаУзлов.Ссылка <> ПланыОбмена.Доставка.ЭтотУзел() Тогда 
			УзелОбъект = ВыборкаУзлов.ПолучитьОбъект(); 

			// Получить сообщение 
			УзелОбъект.ПрочитатьСообщениеСИзменениями(); 

			// Сформировать сообщение 
			УзелОбъект.ЗаписатьСообщениеСИзменениями(); 

		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

