
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗагрузитьКурсыВалют();	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют()
	Соединение = WSСсылки.КурсыВалютССайтаЦБ.СоздатьWSПрокси("http://web.cbr.ru/", DailyInfo, DailyInfoSoap);
	
	ТипWSПараметра = Соединение.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");
	СегодняшняяДата = Соединение.ФабрикаXDTO.Создать(ТипWSПараметра);
	СегодняшняяДата.On_Date = ТекущаяДата();                         

	КурсыВалют = Соединение.GetCourseOnDate(СегодняшняяДата);
	
	НовыйДок = Документы.УстановкаКурсаВалют.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	
	Для Каждого Элемент из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл
		
		НайденнаяВалюта = Спраовчники.Валюты.НайтиПоКоду(Элемент.Vcode);
		
		Если ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
			НоваяСтрока = НовыйДок.Валюты.Добавить();
			НоваяСтрока.Курс = Элемент.Vcurs;
			НоваяСтрока.Валюта = НайденнаяВалюта;
		Иначе
				
		КонецЕсли;
		
	КонецЦикла;   

	
	
	Если Константы.АвтоматическиПроводитьДокумент = Истина Тогда
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		НовыйДок.Записать();       
		
		
	Сообщить("Курс валют загружен: Создан документ: " + НовыйДок.Ссылка);
	
	
	
КонецПроцедуры;
