
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.ОстаткиПродуктов.Записывать = Истина;
	Движения.СтоимостьПродуктов.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	Для Каждого ТекСтрокаПриход Из Приход Цикл
		
		// регистр ОстаткиПродуктов Приход
		Движение = Движения.ОстаткиПродуктов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукт = ТекСтрокаПриход.Продукт;
		Движение.НаборСвойств = ТекСтрокаПриход.НаборСвойств; 
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Количество = ТекСтрокаПриход.Количество;
		
		// регистр СтоимостьПродуктов Приход
		Движение = Движения.СтоимостьПродуктов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукт = ТекСтрокаПриход.Продукт;
		Движение.Стоимость = ТекСтрокаПриход.Сумма;
		
		//регистр Управленческий Движение = Движения.Управленческий.Добавить(); 
		Движение.СчетДт = ПланыСчетов.Основной.Товары;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.Период = Дата; 
		Движение.Сумма = ТекСтрокаПриход.Сумма; 
		Движение.КоличествоДт = ТекСтрокаПриход.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Продукты] = ТекСтрокаПриход.Продукт; 
		
	КонецЦикла;
	
	
КонецПроцедуры
