
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	Движения.ОстаткиПродуктов.Записывать = Истина;
	Движения.СтоимостьПродуктов.Записывать = Истина;
	Для Каждого ТекСтрокаПриход Из Приход Цикл
		
		// регистр ОстаткиПродуктов Приход
		Движение = Движения.ОстаткиПродуктов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукт = ТекСтрокаПриход.Продукт;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.НаборСвойств = ТекСтрокаПриход.НаборСвойств;
		Движение.Количество = ТекСтрокаПриход.Количество;
		
		// регистр СтоимостьПродуктов Приход
		Движение = Движения.СтоимостьПродуктов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукт = ТекСтрокаПриход.Продукт;
		Движение.Стоимость = ТекСтрокаПриход.Сумма;
	КонецЦикла;


КонецПроцедуры
