&НаКлиенте 
Процедура ЗарегистрироватьИзменения(Команда) 
	РегистрацияИзмененийНаСервере(Элементы.Список.ТекущаяСтрока); 
КонецПроцедуры 

&НаСервереБезКонтекста 
Процедура РегистрацияИзмененийНаСервере(Узел) 
	// Регистрация изменений всех данных для узла 
	ПланыОбмена.ЗарегистрироватьИзменения(Узел); 
КонецПроцедуры 

&НаСервереБезКонтекста 
Функция ПредопределенныйУзел(Узел) 
	Возврат Узел = ПланыОбмена.Доставка.ЭтотУзел(); 
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если ПредопределенныйУзел(Элемент.ТекущаяСтрока) Тогда 
		Элементы.ЗарегистрироватьИзменения.Доступность = Ложь; 
	Иначе 
		Элементы.ЗарегистрироватьИзменения.Доступность = Истина; 
	КонецЕсли; 
КонецПроцедуры
