&НаКлиенте
Процедура КнопкаЗакрытие(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура КнопкаОчистка(Команда)
	ПервоеЦифра = 0;
	ВтороеЦифра = 0;
	Объект.Результат = 0;
	Сообщить("Поля успешно очищены");
КонецПроцедуры 

&НаКлиенте
Процедура КнопкаИнфо(Команда)
	ОткрытьФорму("Обработка.Калькулятор.Форма.Инфо");
КонецПроцедуры

&НаКлиенте
Процедура ОперацияАрккосинус(Команда)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияАрксинус(Команда)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияВозведениеВСтепень(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "ВозведениеВСтепень";
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияВычитание(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Вычитание";
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияДеление(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Деление";
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияКвадратныйКорень(Команда)
	Буфер = Число(Табло);
	Табло = sqrt(Буфер);	
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияКосинус(Команда)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияОбратноеЗначение(Команда)
	Буфер = Число(Табло);
	Табло = 1 / Буфер;
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияСинус(Команда)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияСложение(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Сложение";
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияТангенс(Команда)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияУмножение(Команда)
	Буфер = Число(Табло);
	Табло = 0;
	Операция = "Умножение";
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияФакториал(Команда)
	Факториал(Табло);
	Табло = Факториал(Табло);
КонецПроцедуры 

Функция Факториал (Знач Значение)  
	Если Значение <= 0 Тогда 
		Возврат 1 
	КонецЕсли;
	
	Возврат Значение * Факториал(Значение - 1);		
КонецФункции


&НаКлиенте
Процедура ОперацияЭкспонента(Команда)
	
КонецПроцедуры   

&НаКлиенте
Процедура КнопкаРавно(Команда)
	Если Операция = "Сложение" Тогда
		Табло = Буфер + Табло;
		
	ИначеЕсли Операция = "Вычитание" Тогда
		Табло = Буфер - Табло;
		
	ИначеЕсли Операция = "Умоножение" Тогда
		Табло = Буфер * Табло;
		
	ИначеЕсли Операция = "Деление" Тогда
		Табло = Буфер / Табло;

	ИначеЕсли Операция = "Степень" Тогда
		Табло = Pow(Буфер, Табло);

	КонецЕсли;
КонецПроцедуры   


// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

&НаКлиенте
Процедура Цифра0(Команда)
	ВыводЦифры0 = 0;
	Табло = Табло + Лев(ВыводЦифры0, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра1(Команда)
	ВыводЦифры1 = 1;
	Табло = Табло + Лев(ВыводЦифры1, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра2(Команда)
	ВыводЦифры2 = 2;
	Табло = Табло + Лев(ВыводЦифры2, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра3(Команда)
	ВыводЦифры3 = 3;
	Табло = Табло + Лев(ВыводЦифры3, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра4(Команда)
	ВыводЦифры4 = 4;
	Табло = Табло + Лев(ВыводЦифры4, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра5(Команда)
	ВыводЦифры5 = 5;
	Табло = Табло + Лев(ВыводЦифры5, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра6(Команда)
	ВыводЦифры6 = 6;
	Табло = Табло + Лев(ВыводЦифры6, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра7(Команда)
	ВыводЦифры7 = 7;
	Табло = Табло + Лев(ВыводЦифры7, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра8(Команда)
	ВыводЦифры8 = 8;
	Табло = Табло + Лев(ВыводЦифры8, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура Цифра9(Команда)
	ВыводЦифры9 = 9;
	Табло = Табло + Лев(ВыводЦифры9, 9);
	Табло = Прав(Число(Табло),11);
КонецПроцедуры 

&НаКлиенте
Процедура СкобкаОткрыть(Команда)
Табло = "(";
КонецПроцедуры 

&НаКлиенте
Процедура СкобкаЗакрыть(Команда)
Табло = ")";
КонецПроцедуры 