&НаКлиенте
Процедура КнопкаЗакрытие(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура КнопкаОчистка(Команда)
	ПервоеЧисло = 0;
	ВтороеЧисло = 0;
	Сообщить("Поля успешно очищены");
КонецПроцедуры 

&НаКлиенте
Процедура КнопкаИнфо(Команда)
	ОткрытьФорму("Обработка.Калькулятор.Форма.Инфо");
КонецПроцедуры

&НаКлиенте
Процедура ОперацияАрккосинус(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияАрксинус(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияВозведениеВСтепень(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияВычитание(Команда)
	Результат = ПервоеЧисло - ВтороеЧисло;
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияДеление(Команда)
	Результат = ПервоеЧисло / ВтороеЧисло;
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияКвадратныйКорень(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияКосинус(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияОбратноеЗначение(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияСинус(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияСложение(Команда)
	Результат = ПервоеЧисло + ВтороеЧисло;
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияТангенс(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияУмножение(Команда)
	Результат = ПервоеЧисло * ВтороеЧисло;
КонецПроцедуры 

&НаКлиенте
Процедура ОперацияФакториал(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура ОперацияЭкспонента(Команда)

КонецПроцедуры 

// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

&НаКлиенте
Процедура Число0(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число1(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число2(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число3(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число4(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число5(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число6(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число7(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число8(Команда)

КонецПроцедуры 

&НаКлиенте
Процедура Число9(Команда)

КонецПроцедуры 
