&НаКлиенте
Процедура ПокупкаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры   

&НаКлиенте
Процедура ПокупкаСкидкаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры


&НаКлиенте
Процедура ПокупкаНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена=РаботаСоСправочникамиСервер.РозничнаяЦена(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура);

	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
