
Процедура ОбновлениеИндекса() Экспорт          
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Запуск регламентного задания Обновление индекса " + ТекущаяДата();
	Сообщение.Сообщить();

	// проверяется возможность выполнения операций, связанных с полнотекстовым поиском 
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		// актуален ли полнотекстовый поиск 
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда 
			// В случае необходимости индексирования вызывается метод
			ПолнотекстовыйПоиск.ОбновитьИндекс( , Истина); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Процедура СлияниеИндексов() Экспорт
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 
