#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>

Когда В панели разделов я выбираю "Управление производством"
И В командном интерфейсе я выбираю "Управление торговлей" "Реестр документов оплата через кассу"
Тогда открылось окно "Реестр документов оплата через кассу"
И я нажимаю на кнопку с именем 'ФормаСформировать'
