
&НаКлиенте
Процедура ПриходКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.ПереченьНоменклатуры.ТекущиеДанные;        
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры       


&НаКлиенте
Процедура ПриходЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПриходПродуктПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена=РаботаСоСправочникамиСервер.РозничнаяЦена(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура);
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина); 
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.ПереченьНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ПриходОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл 
		НоваяСтрока = Объект.ПереченьНоменклатуры.Добавить(); 
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;    
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПодборВопрос(Команда)
	Результат = Ждать ВопросАсинх("Подобрать номенклатуру в документ?", РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Материалы);
	КонецЕсли;
КонецПроцедуры
