Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	// Определить, нужно ли обновлять дату в движениях 
	ОбновитьДатуДвижений = ЭтоНовый() Или Движения.ОстаткиПродуктов.Модифицированность(); 
	Если Не ОбновитьДатуДвижений Тогда 
		// Проверить, что дата изменилась 
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка); 
		Запрос.Текст = 
		"ВЫБРАТЬ 
		| Дата 
		|ИЗ
		| Документ.ВводНачальныхОстатковНоменклатуры 
		|ГДЕ Ссылка = &ТекущийДокумент"; 
		Выборка = Запрос.Выполнить().Выбрать(); 
		Выборка.Следующий(); 
		ОбновитьДатуДвижений = Выборка.Дата <> Дата; 
	КонецЕсли; 
	// Установить всем новую дату, если нужно 
	Если ОбновитьДатуДвижений Тогда 
		Если Не Движения.ОстаткиПродуктов.Выбран() И 
			Не Движения.ОстаткиПродуктов.Модифицированность() Тогда 
			Движения.ОстаткиПродуктов.Прочитать(); 
		КонецЕсли; 
		Для Каждого ЗаписьРегистра Из Движения.ОстаткиПродуктов Цикл 
			ЗаписьРегистра.Период = Дата; 
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого ЗаписьРегистра Из Объект.Движения.ОстаткиПродуктов Цикл 
		ЗаписьРегистра.Период = Объект.Дата; 
	КонецЦикла; 
	
КонецПроцедуры
