
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	
	// регистр ОстаткиПродукции Расход
	Движения.ОстаткиПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаПеремещение Из Перемещение Цикл
		Движение = Движения.ОстаткиПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Продукция = ТекСтрокаПеремещение.Продукция;
		Движение.ОбъектПредприятия = Отправитель;    
		Движение.НаборСвойств = ТекСтрокаПеремещение.НаборСвойств;
		Движение.Количество = ТекСтрокаПеремещение.Количество;
	КонецЦикла;

	
	// регистр ОстаткиПродукции Приход
	Движения.ОстаткиПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаПеремещение Из Перемещение Цикл
		Движение = Движения.ОстаткиПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукция = ТекСтрокаПеремещение.Продукция;
		Движение.ОбъектПредприятия = Получатель;          
		Движение.НаборСвойств = ТекСтрокаПеремещение.НаборСвойств;
		Движение.Количество = ТекСтрокаПеремещение.Количество;
	КонецЦикла;

КонецПроцедуры
