Процедура ПечатьКассовогоЧека(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьКассовогоЧека)
	Макет = Документы.РасчетыЧерезКассу.ПолучитьМакет("ПечатьКассовогоЧека");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыЧерезКассу.Дата,
	|	РасчетыЧерезКассу.Клиент,
	|	РасчетыЧерезКассу.Номер,
	|	РасчетыЧерезКассу.Продавец,
	|	РасчетыЧерезКассу.ТорговаяТочка,
	|	РасчетыЧерезКассу.Покупка.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,     
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РасчетыЧерезКассу КАК РасчетыЧерезКассу
	|ГДЕ
	|	РасчетыЧерезКассу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПокупкаШапка = Макет.ПолучитьОбласть("ПокупкаШапка");
	ОбластьПокупка = Макет.ПолучитьОбласть("Покупка"); 
	ОбластьИтог=Макет.ПолучитьОбласть("Итого");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПокупкаШапка);
		ВыборкаПокупка = Выборка.Покупка.Выбрать();
		СуммаИтог=0;
		Пока ВыборкаПокупка.Следующий() Цикл
			ОбластьПокупка.Параметры.Заполнить(ВыборкаПокупка);
			ТабДок.Вывести(ОбластьПокупка, ВыборкаПокупка.Уровень());    
			СуммаИтог=СуммаИтог+ВыборкаПокупка.Сумма;
		КонецЦикла;
        ОбластьИтог.Параметры.ИтогоПоДокументу=СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

                       


