
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продажи.Записывать = Истина;	
	Движения.ОстаткиПродуктов.Записывать = Истина;
	Движения.СтоимостьПродуктов.Записывать = Истина;  
	
	//Создать менеджер временных таблиц. 
	МенеджерВТ = Новый МенеджерВременныхТаблиц; 
	Запрос = Новый Запрос; 
	
	//Укажем, какой менеджер временных таблиц использует этот запрос 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыЧерезКассуПокупка.Номенклатура,
	|	РасчетыЧерезКассуПокупка.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(РасчетыЧерезКассуПокупка.Количество) КАК КоличествоВДокументе,
	|	МАКСИМУМ(РасчетыЧерезКассуПокупка.Сумма) КАК СуммаВДокументе
	|ПОМЕСТИТЬ НоменклатураДокумента
	|ИЗ
	|	Документ.РасчетыЧерезКассу.Покупка КАК РасчетыЧерезКассуПокупка
	|ГДЕ
	|	РасчетыЧерезКассуПокупка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыЧерезКассуПокупка.Номенклатура,
	|	РасчетыЧерезКассуПокупка.Номенклатура.ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос2 = Новый Запрос; 
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос2.Текст = "ВЫБРАТЬ
	|	НоменклатураДокумента.Номенклатура,
	|	НоменклатураДокумента.ВидНоменклатуры,
	|	НоменклатураДокумента.КоличествоВДокументе,
	|	НоменклатураДокумента.СуммаВДокументе,
	|	ЕСТЬNULL(СтоимостьПродуктовОстатки.СтоимостьОстаток, 0) КАК Стоимость,
	|	ЕСТЬNULL(ОстаткиПродуктовОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	НоменклатураДокумента КАК НоменклатураДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьПродуктов.Остатки(
	|				,
	|				Продукт В
	|					(ВЫБРАТЬ
	|						НоменклатураДокумента.Номенклатура
	|					ИЗ
	|						НоменклатураДокумента)) КАК СтоимостьПродуктовОстатки
	|		ПО НоменклатураДокумента.Номенклатура = СтоимостьПродуктовОстатки.Продукт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПродуктов.Остатки(
	|				,
	|				Продукт В
	|					(ВЫБРАТЬ
	|						НоменклатураДокумента.Номенклатура
	|					ИЗ
	|						НоменклатураДокумента)) КАК ОстаткиПродуктовОстатки
	|		ПО НоменклатураДокумента.Номенклатура = ОстаткиПродуктовОстатки.Продукт";
	
	
	//Установим необходимость блокировки данных в регистрах СтоимостьМатериалов и ОстаткиМатериа-лов. 
	Движения.СтоимостьПродуктов.БлокироватьДляИзменения = Истина; 
	Движения.ОстаткиПродуктов.БлокироватьДляИзменения = Истина; 


	//Запишем пустые наборы записей, чтобы читать остатки без учета данных в документе. 
	Движения.СтоимостьПродуктов.Записать(); 
	Движения.ОстаткиПродуктов.Записать(); 
	
	Результат = Запрос2.Выполнить(); 
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
			СтоимостьМатериала = 0; 
		Иначе 
			СтоимостьМатериала = ВыборкаДетальныеЗаписи.Стоимость/ВыборкаДетальныеЗаписи.Количество; 
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукт Тогда
			
			// регистр ОстаткиПродуктов Расход
			Движение = Движения.ОстаткиПродуктов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Продукт = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.ТорговаяТочка = ТорговаяТочка;
			Движение.НаборСвойств = ВыборкаДетальныеЗаписи.НаборСвойств;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;    
			
			// регистр СтоимостьПродуктов Расход
			Движение = Движения.СтоимостьПродуктов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Продукт = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе*СтоимостьМатериала;
			
		КонецЕсли;
		
		// регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Продавец = Продавец;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
		Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
		Движение.Стоимость = СтоимостьМатериала * ВыборкаДетальныеЗаписи.КоличествоВДокументе;  
		
	КонецЦикла;
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда 
		//проверить отрицательные остатки. 
		Запрос3 = Новый Запрос; 
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ; 
		Запрос3.Текст = "ВЫБРАТЬ
		|	ОстаткиПродуктовОстатки.Продукт,
		|	ОстаткиПродуктовОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПродуктов.Остатки(
		|			,
		|			Продукт В
		|					(ВЫБРАТЬ
		|						НоменклатураДокумента.Номенклатура
		|					ИЗ
		|						НоменклатураДокумента)
		|				И ТорговаяТочка = &ТорговаяТочка) КАК ОстаткиПродуктовОстатки
		|ГДЕ
		|	ОстаткиПродуктовОстатки.КоличествоОстаток < 0";    
		Запрос3.УстановитьПараметр("ТорговаяТочка", ТорговаяТочка); 
		Результат = Запрос3.Выполнить(); 
		ВыборкаДетальныеЗаписи = Результат.Выбрать(); 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Сообщение = Новый СообщениеПользователю(); 
			Сообщение.Текст = "Не хватает" + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) + "единиц продукта""" + ВыборкаДетальныеЗаписи.Продукт + """"; 
			Сообщение.Сообщить(); 
			Отказ = Истина; 
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

