
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаНачисления.Результат;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаНачисления.Результат;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
	
	//Записываем движения регистров
	Движения.Начисления.Записать();

	//Получим список всех сотрудников, содержащихся в документе
	Запрос=Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|НачисленияСотрудникамНачисления.Сотрудник
	|ИЗ
	| Документ.НачисленияСотрудникам.Начисления
	| КАК НачисленияСотрудникамНачисления
	|
	|ГДЕ
	| НачисленияСотрудникамНачисления.Ссылка=&ТекущийДокумент");

	Запрос.УстановитьПараметр ("ТекущийДокумент", Ссылка);

	//Сформируем список сотрудников
	ТаблЗнач=Запрос.Выполнить().Выгрузить();
	МассивСотрудников=ТаблЗнач.ВыгрузитьКолонку("Сотрудник");
	СписокСотрудников=Новый СписокЗначений;
	СписокСотрудников.ЗагрузитьЗначения(МассивСотрудников);

	РасчитатьНачисления(Движения.Начисления,ПланыВидовРасчета.ВидыНачислений.Оклад, СписокСотрудников);
	Движения.Начисления.Записать(,Истина);

	РасчитатьНачисления(Движения.Начисления,ПланыВидовРасчета.ВидыНачислений.Премия, СписокСотрудников);
	Движения.Начисления.Записать(,Истина);


КонецПроцедуры
